hoanganhidi0822/3-DoF-Robot/Code/STM32/Core/Inc/as5600.h
/*************************************************************************
Title:    as5600.h - Driver for AMS AS5600 12-Bit Programmable Contactless
                                         Potentiometer
Author:   Nicholas Morrow <nickhudspeth@gmail.com>
File:     as5600.h
Software: STM32Fxxx_HAL_Driver, CMSIS-CORE
Hardware: STM32Fxxx
License:  The MIT License (MIT)

DESCRIPTION:


USAGE:
        // Instantiate an AS5600 structure
        AS5600_TypeDef *a = AS5600_New();

    // Configure non-default options, if required.
    a->PositiveRotationDirection = AS5600_DIR_CCW;
        a->LowPowerMode = AS5600_POWER_MODE_LPM2;
    a->OutputStage = AS5600_OUTPUT_STAGE_PWM;
    a->PWMFrequency = AS5600_PWM_FREQUENCY_460HZ;
    a->Watchdog = AS5600_WATCHDOG_OFF;

    // Initialize AS5600 with selected options and check for initialization
errors.
    if(AS5600_Init(a) != HAL_OK){
        _Error_Handler(__FILE__, __LINE__);
    }

    // Read angular measurements
    uint16_t angle = 0;
    while(1){
        AS5600_GetAngle(a, &angle);
        printf("Angle = %ld degrees.\n", angle);
    }

NOTES:
    Driver does not currently support permanent writing of registers using OTP
burn commands.
    Driver does not currently support angle measurement using ADC.
    Driver does not currently support angle measurement using AS5600 in PWM
output mode.

TO-DO:


LICENSE:
    Copyright (C) 2018 Pathogen Systems, Inc. dba Crystal Diagnostics

    Permission is hereby granted, free of charge, to any person obtaining a copy
    of this software and associated documentation files (the "Software"), to
    deal in the Software without restriction, including without limitation the
    rights to use, copy, modify, merge, publish, distribute, sublicense,
    and/or sell copies of the Software, and to permit persons to whom the
    Software is furnished to do so, subject to the following conditions:

    The above copyright notice and this permission notice shall be included in
    all copies or substantial portions of the Software.

    THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.IN NO EVENT SHALL THE
    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,ARISING FROM,
    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
    THE SOFTWARE.

*************************************************************************/
#ifndef AS5600_H_
#define AS5600_H_
/**********************    INCLUDE DIRECTIVES    ***********************/
#include <stdint.h>
#include "stm32h7xx_hal.h"
#include "stm32h723xx.h"
//#include "stm32h723zgt6.h"

/**************    CONSTANTS, MACROS, & DATA STRUCTURES    ***************/
#define AS5600_SLAVE_ADDRESS 0x36
/* AS5600 Configuration Registers */
#define AS5600_REGISTER_ZMCO 0x00
#define AS5600_REGISTER_ZPOS_HIGH 0x01
#define AS5600_REGISTER_ZPOS_LOW 0x02
#define AS5600_REGISTER_MPOS_HIGH 0x03
#define AS5600_REGISTER_MPOS_LOW 0x04
#define AS5600_REGISTER_MANG_HIGH 0x05
#define AS5600_REGISTER_MANG_LOW 0x06
#define AS5600_REGISTER_CONF_HIGH 0x07
#define AS5600_REGISTER_CONF_LOW 0x08
/* AS5600 Output Registers */
#define AS5600_REGISTER_RAW_ANGLE_HIGH 0x0C
#define AS5600_REGISTER_RAW_ANGLE_LOW 0x0D
#define AS5600_REGISTER_ANGLE_HIGH 0x0E
#define AS5600_REGISTER_ANGLE_LOW 0x0F






#define AS5600_DIR_CW 1
#define AS5600_DIR_CCW 2

#define AS5600_12_BIT_MASK (uint16_t)4095
typedef struct {
    I2C_HandleTypeDef *i2cHandle;
    uint8_t i2cAddr;
    GPIO_TypeDef *DirPort;
    uint16_t DirPin;
    uint8_t PositiveRotationDirection;
    uint8_t LowPowerMode;
    uint8_t Hysteresis;
    uint8_t OutputMode;
    uint8_t PWMFrequency;
    uint8_t SlowFilter;
    uint8_t FastFilterThreshold;
    uint8_t WatchdogTimer;

    /* Private */
    volatile uint8_t confRegister[2];

} AS5600_TypeDef;
/***********************    FUNCTION PROTOTYPES    ***********************/

AS5600_TypeDef *AS5600_New(void);
HAL_StatusTypeDef AS5600_Init(AS5600_TypeDef *a);

HAL_StatusTypeDef AS5600_SetStartPosition(AS5600_TypeDef *const a, const float degrees);
HAL_StatusTypeDef AS5600_SetStopPosition(AS5600_TypeDef *const a,
                                         const uint16_t pos);
HAL_StatusTypeDef AS5600_SetMaxAngle(AS5600_TypeDef *const a,
                                     const uint16_t angle);

HAL_StatusTypeDef AS5600_SetPositiveRotationDirection(AS5600_TypeDef *const a,
                                                      const uint8_t dir);


HAL_StatusTypeDef AS5600_GetRawAngle(AS5600_TypeDef *as5600, float *angle);
HAL_StatusTypeDef AS5600_GetAngle(AS5600_TypeDef *as5600, float *angle);



#endif /* AS5600_H_ */
